SpenceKonde/megaTinyCore/megaavr/boards.txt
### BOD MODE
microchip.menu.bodmode.disabled=Disabled/Disabled
microchip.menu.bodmode.enabled=Enabled/Enabled
microchip.menu.bodmode.ensampfast=Enabled/Sampled (1 kHz)
microchip.menu.bodmode.ensampslow=Enabled/Sampled (125 Hz)
microchip.menu.bodmode.sampledfast=Sampled/Sampled (1 kHz)
microchip.menu.bodmode.sampledslow=Sampled/Sampled (125 Hz)
microchip.menu.bodmode.sampdisfast=Sampled/Disabled (1 kHz)
microchip.menu.bodmode.sampdisslow=Sampled/Disabled (125 Hz)
microchip.menu.bodmode.endisholdwake=Enabled hold wakeup/Disabled
microchip.menu.bodmode.disabled.bootloader.BODCFG=0x00
microchip.menu.bodmode.enabled.bootloader.bodmodebits=00101
microchip.menu.bodmode.ensampfast.bootloader.bodmodebits=00110
microchip.menu.bodmode.ensampslow.bootloader.bodmodebits=10110
microchip.menu.bodmode.samplefast.bootloader.bodmodebits=01010
microchip.menu.bodmode.sampleslow.bootloader.bodmodebits=11010
microchip.menu.bodmode.sampdisfast.bootloader.bodmodebits=01000
microchip.menu.bodmode.sampdisslow.bootloader.bodmodebits=11000
microchip.menu.bodmode.endisholdwake.bootloader.bodmodebits=01100

### EEPROM RETAIN
microchip.menu.eesave.enable=EEPROM retained
microchip.menu.eesave.enable.bootloader.eesavebit=1
microchip.menu.eesave.disable=EEPROM not retained
microchip.menu.eesave.disable.bootloader.eesavebit=0

### MILLIS TIMER
microchip.menu.millis.enabled=Enabled (default timer)
microchip.menu.millis.disabled=Disabled (saves flash)
microchip.menu.millis.timera=TCA0 (default on 0-series)
microchip.menu.millis.timerd=TCD0 (1-series only, default there)
microchip.menu.millis.timerb0=TCB0 (breaks tone() and Servo)
microchip.menu.millis.timerb1=TCB1 (3217,1617, 2-series only)
microchip.menu.millis.rtc=RTC (no micros)
microchip.menu.millis.rtcxtal=RTC w/w32.768 kHz ext. crystal (1/2-series only, no micros)
microchip.menu.millis.rtcxosc=RTC w/w32.768 kHz ext. oscillator (1/2-series only, no micros)
microchip.menu.millis.disabled.build.millistimer=NONE
microchip.menu.millis.timera.build.millistimer=A0
microchip.menu.millis.timerd.build.millistimer=D0
microchip.menu.millis.timerb0.build.millistimer=B0
microchip.menu.millis.timerb1.build.millistimer=B1
microchip.menu.millis.rtc.build.millistimer=RTC
microchip.menu.millis.rtcxtal.build.millistimer=RTC_XTAL
microchip.menu.millis.rtcxosc.build.millistimer=RTC_XOSC

### UPDI/RESET PIN CONFIGURATION
microchip.menu.resetpin.UPDI=UPDI (no reset pin)
microchip.menu.resetpin.UPDI.bootloader.resetpinbits=01
microchip.menu.resetpin.UPDIaltrst=UPDI w/reset on PB4 (2-series only)
microchip.menu.resetpin.UPDIaltrst.bootloader.resetpinbits={bootloader.altreset}
# the microchip debuggers are not 12v tolerant so nothing that would need hv programming to reset is supported. And if you cut the straps to debugger, you shouldn't be using this board definition.


### STARTUP TIME (SUT)
microchip.menu.startuptime.8=8ms
microchip.menu.startuptime.0=0ms
microchip.menu.startuptime.1=1ms
microchip.menu.startuptime.2=2ms
microchip.menu.startuptime.4=4ms
microchip.menu.startuptime.16=16ms
microchip.menu.startuptime.32=32ms
microchip.menu.startuptime.64=64ms
microchip.menu.startuptime.0.bootloader.SYSCFG1=0x00
microchip.menu.startuptime.1.bootloader.SYSCFG1=0x01
microchip.menu.startuptime.2.bootloader.SYSCFG1=0x02
microchip.menu.startuptime.4.bootloader.SYSCFG1=0x03
microchip.menu.startuptime.8.bootloader.SYSCFG1=0x04
microchip.menu.startuptime.16.bootloader.SYSCFG1=0x05
microchip.menu.startuptime.32.bootloader.SYSCFG1=0x06
microchip.menu.startuptime.64.bootloader.SYSCFG1=0x07

### VOLTAGE FOR UART BAUD CORRECTION
microchip.menu.uartvoltage.skip=Ignore (saves flash, almost always fine)
microchip.menu.uartvoltage.skip.build.uartvoltage=NA
microchip.menu.uartvoltage.5v=Closer to 5v
microchip.menu.uartvoltage.3v=Closer to 3v
microchip.menu.uartvoltage.5v.build.uartvoltage=5V
microchip.menu.uartvoltage.3v.build.uartvoltage=3V




##########################################################################
##########################################################################
#                                                                        #
#           ###   ####   #####  ###  ####    ###    ###   #####          #
#          #   #  #   #    #     #   #   #  #   #  #   #    #            #
#          #   #  ####     #     #   ####   #   #  #   #    #            #
#          #   #  #        #     #   #   #  #   #  #   #    #            #
#           ###   #        #    ###  ####    ###    ###     #            #
#________________________________________________________________________#
##########################################################################

##########################################################################
#  WITH OPTIBOOT                                                         #
#  0/1-series                    ##   #  #     ####   ###  #   #         #
#                               #  #  #  #     #   #   #   ##  #         #
#  ATtiny3217/1617                #   #### === ####    #   # # #         #
#  ATtiny1607/817                #       #     #       #   #  ##         #
#  ATtiny807/417                ####     #     #      ###  #   #         #
#________________________________________________________________________#

### BUILD PARAMETERS
atxy7o.build.text_section_start=.text=0x200
atxy7o.build.millistimer=D0
atxy7o.build.bootload=opti
atxy7o.build.board=AVR_ATtinyxy7
atxy7o.build.clocksource=0
atxy7o.build.core=megatinycore
atxy7o.build.variant=txy7
atxy7o.build.mcu=attiny{build.attiny}
atxy7o.build.f_cpu={build.speed}000000L
atxy7o.build.extra_flags=-DARDUINO_attinyxy7 -DMILLIS_USE_TIMER{build.millistimer} -DUARTBAUD{build.uartvoltage} -DUSING_OPTIBOOT
atxy7o.build.export_merged_output=true

### BOOTLOADING PARAMETERS
atxy7o.bootloader.WDTCFG=0x00
atxy7o.bootloader.BODCFG=0b{bootloader.bodlevbits}{bootloader.bodmodebits}
atxy7o.bootloader.OSCCFG=0x01
atxy7o.bootloader.TCD0CFG=0x00
atxy7o.bootloader.SYSCFG0=0b1100{bootloader.resetpinbits}00
atxy7o.bootloader.APPEND=0x00
atxy7o.bootloader.BOOTEND=0x02
atxy7o.bootloader.tool=avrdude
atxy7o.bootloader.avrdudestring=-Uflash:w:{runtime.platform.path}/bootloaders/hex/{bootloader.file}:i
atxy7o.bootloader.pymcuprogstring=-f{runtime.platform.path}/bootloaders/hex/{bootloader.file} -a write

### UPLOAD VIA OPTIBOOT
atxy7o.upload.workaround=
atxy7o.upload.tool=avrdude
atxy7o.upload.serialparams=-P{serial.port} -b115200
atxy7o.upload.protocol=arduino
atxy7o.upload.extra_params=-D

### CHIP
atxy7o.menu.chip.3217=ATtiny3217
atxy7o.menu.chip.3217.build.board=AVR_ATtiny3217
atxy7o.menu.chip.3217.build.attiny=3217
atxy7o.menu.chip.3217.upload.maximum_size=32256
atxy7o.menu.chip.3217.upload.maximum_data_size=2048
atxy7o.menu.chip.1617=ATtiny1617
atxy7o.menu.chip.1617.build.board=AVR_ATtiny1617
atxy7o.menu.chip.1617.build.attiny=1617
atxy7o.menu.chip.1617.upload.maximum_size=15872
atxy7o.menu.chip.1617.upload.maximum_data_size=2048
atxy7o.menu.chip.817=ATtiny817
atxy7o.menu.chip.817.build.board=AVR_ATtiny817
atxy7o.menu.chip.817.build.attiny=817
atxy7o.menu.chip.817.upload.maximum_size=7680
atxy7o.menu.chip.817.upload.maximum_data_size=512
atxy7o.menu.chip.417=ATtiny417
atxy7o.menu.chip.417.build.board=AVR_ATtiny417
atxy7o.menu.chip.417.build.attiny=417
atxy7o.menu.chip.417.upload.maximum_size=3584
atxy7o.menu.chip.417.upload.maximum_data_size=256
atxy7o.menu.chip.1607=ATtiny1607
atxy7o.menu.chip.1607.build.board=AVR_ATtiny1607
atxy7o.menu.chip.1607.build.attiny=1607
atxy7o.menu.chip.1607.build.millistimer=A0
atxy7o.menu.chip.1607.upload.maximum_size=15872
atxy7o.menu.chip.1607.upload.maximum_data_size=1024
atxy7o.menu.chip.807=ATtiny807
atxy7o.menu.chip.807.build.board=AVR_ATtiny807
atxy7o.menu.chip.807.build.attiny=807
atxy7o.menu.chip.807.build.millistimer=A0
atxy7o.menu.chip.807.upload.maximum_size=7680
atxy7o.menu.chip.807.upload.maximum_data_size=512

### CLOCK SOURCE

