SpenceKonde/megaTinyCore/megaavr/boards.txt
### BOD MODE
atxy6o.menu.bodmode.disabled=Disabled/Disabled
atxy6o.menu.bodmode.enabled=Enabled/Enabled
atxy6o.menu.bodmode.ensampfast=Enabled/Sampled (1 kHz)
atxy6o.menu.bodmode.ensampslow=Enabled/Sampled (125 Hz)
atxy6o.menu.bodmode.sampledfast=Sampled/Sampled (1 kHz)
atxy6o.menu.bodmode.sampledslow=Sampled/Sampled (125 Hz)
atxy6o.menu.bodmode.sampdisfast=Sampled/Disabled (1 kHz)
atxy6o.menu.bodmode.sampdisslow=Sampled/Disabled (125 Hz)
atxy6o.menu.bodmode.endisholdwake=Enabled hold wakeup/Disabled
atxy6o.menu.bodmode.disabled.bootloader.BODCFG=0x00
atxy6o.menu.bodmode.enabled.bootloader.bodmodebits=00101
atxy6o.menu.bodmode.ensampfast.bootloader.bodmodebits=00110
atxy6o.menu.bodmode.ensampslow.bootloader.bodmodebits=10110
atxy6o.menu.bodmode.samplefast.bootloader.bodmodebits=01010
atxy6o.menu.bodmode.sampleslow.bootloader.bodmodebits=11010
atxy6o.menu.bodmode.sampdisfast.bootloader.bodmodebits=01000
atxy6o.menu.bodmode.sampdisslow.bootloader.bodmodebits=11000
atxy6o.menu.bodmode.endisholdwake.bootloader.bodmodebits=01100

### VOLTAGE FOR UART BAUD CORRECTION
atxy6o.menu.uartvoltage.skip=Ignore (saves flash, almost always fine)
atxy6o.menu.uartvoltage.skip.build.uartvoltage=NA
atxy6o.menu.uartvoltage.5v=Closer to 5v
atxy6o.menu.uartvoltage.3v=Closer to 3v
atxy6o.menu.uartvoltage.5v.build.uartvoltage=5V
atxy6o.menu.uartvoltage.3v.build.uartvoltage=3V

atxy6o.build.clocksource=0
atxy6o.build.core=megatinycore
atxy6o.build.variant=txy6
atxy6o.build.extra_flags=-DARDUINO_attinyxy6 -DMILLIS_USE_TIMER{build.millistimer} -DUARTBAUD{build.uartvoltage}
atxy6o.build.export_merged_output=true

### UPDI/RESET PIN CONFIGURATION & OPTIBOOT ENTRY
atxy6o.menu.resetpinopti.UPDI=UPDI, Optiboot for 8 sec. after power-on & reset
atxy6o.menu.resetpinopti.UPDI.bootloader.file=optiboot_txyz{bootloader.uartswap}.hex
atxy6o.menu.resetpinopti.UPDI.bootloader.resetpinbits=01
atxy6o.menu.resetpinopti.UPDIFastBoot=UPDI, Optiboot for 1 sec. after power-on & reset
atxy6o.menu.resetpinopti.UPDIFastBoot.bootloader.file=optiboot_txyz{bootloader.uartswap}_1sec.hex
atxy6o.menu.resetpinopti.UPDIFastBoot.bootloader.resetpinbits=01
atxy6o.menu.resetpinopti.reset=Reset, Optiboot for 1 sec. after reset *DANGER* HV UPDI programmer req'd for reprogramming!
atxy6o.menu.resetpinopti.reset.bootloader.file=optiboot_txyz{bootloader.uartswap}_rst.hex
atxy6o.menu.resetpinopti.reset.bootloader.resetpinbits=10
atxy6o.menu.resetpinopti.gpio=GPIO, Optiboot for 8 sec. after power-on & SW reset *DANGER* HV programmer req'd for reprogramming! (PCHV)
atxy6o.menu.resetpinopti.gpio.bootloader.file=optiboot_txyz{bootloader.uartswap}.hex
atxy6o.menu.resetpinopti.gpio.bootloader.resetpinbits=00

### STARTUP TIME (SUT)
atxy6o.menu.startuptimeopti.8=8ms
atxy6o.menu.startuptimeopti.0=0ms
atxy6o.menu.startuptimeopti.1=1ms
atxy6o.menu.startuptimeopti.2=2ms
atxy6o.menu.startuptimeopti.4=4ms
atxy6o.menu.startuptimeopti.16=16ms
atxy6o.menu.startuptimeopti.32=32ms
atxy6o.menu.startuptimeopti.64=64ms
atxy6o.menu.startuptimeopti.0.bootloader.SYSCFG1=0x00
atxy6o.menu.startuptimeopti.1.bootloader.SYSCFG1=0x01
atxy6o.menu.startuptimeopti.2.bootloader.SYSCFG1=0x02
atxy6o.menu.startuptimeopti.4.bootloader.SYSCFG1=0x03
atxy6o.menu.startuptimeopti.8.bootloader.SYSCFG1=0x04
atxy6o.menu.startuptimeopti.16.bootloader.SYSCFG1=0x05
atxy6o.menu.startuptimeopti.32.bootloader.SYSCFG1=0x06
atxy6o.menu.startuptimeopti.64.bootloader.SYSCFG1=0x07

### BOOTLOADER UART PINS
atxy6o.menu.bootloaderuart.default=TX:7 (PB2), RX:6 (PB3)
atxy6o.menu.bootloaderuart.alternate=TX:14 (PA1), RX:15 (PA2)
atxy6o.menu.bootloaderuart.default.bootloader.uartswap=
atxy6o.menu.bootloaderuart.alternate.bootloader.uartswap=_alt

##########################################################################
#  WITH OPTIBOOT                                                    ##   #
#  2-series                      ##    ###      ####   ###  #   #   ##   #
#                               #  #  #   #     #   #   #   ##  #   ##   #
#  ATtiny3226/1626                #   #   # === ####    #   # # #   ##   #
#  ATtiny826/426                 #    #   #     #       #   #  ##   ##   #
#                               ####   ###      #      ###  #   #   ##   #
#___________________________________________________________________##___#

### BUILD PARAMETERS
atx26o.build.text_section_start=.text=0x200
atx26o.build.millistimer=B1
atx26o.build.bootload=opti
atx26o.build.board=AVR_ATtinyxy6
atx26o.build.clocksource=0
atx26o.build.core=megatinycore
atx26o.build.variant=txy6
atx26o.build.mcu=attiny{build.attiny}
atx26o.build.f_cpu={build.speed}000000L
atx26o.build.extra_flags=-DARDUINO_attinyx26 -DMILLIS_USE_TIMER{build.millistimer} -DUSING_OPTIBOOT
atx26o.build.export_merged_output=true
atx26o.build.uartvoltage=

### BOOTLOADING PARAMETERS
atx26o.bootloader.WDTCFG=0x00
atx26o.bootloader.BODCFG=0b{bootloader.bodlevbits}{bootloader.bodmodebits}
atx26o.bootloader.OSCCFG=0x01
atx26o.bootloader.TCD0CFG=0x00
atx26o.bootloader.SYSCFG0=0b1100{bootloader.resetpinbits}00
atx26o.bootloader.APPEND=0x00
atx26o.bootloader.BOOTEND=0x02
atx26o.bootloader.tool=avrdude
atx26o.bootloader.avrdudestring=-Uflash:w:{runtime.platform.path}/bootloaders/hex/{bootloader.file}:i
atx26o.bootloader.pymcuprogstring=-f{runtime.platform.path}/bootloaders/hex/{bootloader.file} -a write

### UPLOAD VIA OPTIBOOT
atx26o.upload.workaround=
atx26o.upload.tool=avrdude
atx26o.upload.upload.serialparams=-P{serial.port} -b115200
atx26o.upload.protocol=arduino
atx26o.upload.extra_params=-D

### CHIP
atx26o.menu.chip.3226=ATtiny3226
atx26o.menu.chip.3226.build.board=AVR_ATtiny3226
atx26o.menu.chip.3226.build.attiny=3226
atx26o.menu.chip.3226.upload.maximum_size=32256
atx26o.menu.chip.3226.upload.maximum_data_size=3072
atx26o.menu.chip.1626=ATtiny1626
atx26o.menu.chip.1626.build.board=AVR_ATtiny1626
atx26o.menu.chip.1626.build.attiny=1626
atx26o.menu.chip.1626.upload.maximum_size=15872
atx26o.menu.chip.1626.upload.maximum_data_size=2048
atx26o.menu.chip.826=ATtiny826
atx26o.menu.chip.826.build.board=AVR_ATtiny826
atx26o.menu.chip.826.build.attiny=826
atx26o.menu.chip.826.upload.maximum_size=7680
atx26o.menu.chip.826.upload.maximum_data_size=1024
atx26o.menu.chip.426=ATtiny426
atx26o.menu.chip.426.build.board=AVR_ATtiny426
atx26o.menu.chip.426.build.attiny=426
atx26o.menu.chip.426.upload.maximum_size=3584
atx26o.menu.chip.426.upload.maximum_data_size=512

### CLOCK SOURCE
atx26o.menu.clocko.20internal=20 MHz internal
atx26o.menu.clocko.16internal=16 MHz internal
atx26o.menu.clocko.10internal=10 MHz internal
atx26o.menu.clocko.8internal=8 MHz internal
atx26o.menu.clocko.5internal=5 MHz internal
atx26o.menu.clocko.4internal=4 MHz internal
atx26o.menu.clocko.1internal=1 MHz internal
atx26o.menu.clocko.20internaltuned=20 MHz internal - tuned
atx26o.menu.clocko.16internaltuned=16 MHz internal - tuned
atx26o.menu.clocko.12internaltuned=12 MHz internal - tuned
atx26o.menu.clocko.20extclock=20 MHz external clock
atx26o.menu.clocko.16extclock=16 MHz external clock
atx26o.menu.clocko.12extclock=12 MHz external clock
atx26o.menu.clocko.10extclock=10 MHz external clock
atx26o.menu.clocko.8extclock=8 MHz external clock
atx26o.menu.clocko.24internaltuned=24 MHz internal - tuned, overclocked
atx26o.menu.clocko.25internaltuned=25 MHz internal - tuned, overclocked
atx26o.menu.clocko.30internaltuned=30 MHz internal - tuned, overclocked, may be unstable, req. 20 MHz fuse
atx26o.menu.clocko.32internaltuned=32 MHz internal - tuned, 2-series, overclocked, may be unstable, req. 20 MHz fuse
atx26o.menu.clocko.24extclock=24 MHz external clock - overclocked
atx26o.menu.clocko.25extclock=25 MHz external clock - overclocked
atx26o.menu.clocko.30extclock=30 MHz external clock - overclocked, may be unstable
atx26o.menu.clocko.32extclock=32 MHz external clock - overclocked, may be unstable
atx26o.menu.clocko.20internal.build.speed=20
atx26o.menu.clocko.20internal.build.clocksource=0
atx26o.menu.clocko.16internal.build.speed=16
atx26o.menu.clocko.16internal.build.clocksource=0
atx26o.menu.clocko.10internal.build.speed=10
atx26o.menu.clocko.10internal.build.clocksource=0
atx26o.menu.clocko.8internal.build.speed=8
atx26o.menu.clocko.8internal.build.clocksource=0
atx26o.menu.clocko.5internal.build.speed=5
atx26o.menu.clocko.5internal.build.clocksource=0
atx26o.menu.clocko.4internal.build.speed=4
atx26o.menu.clocko.4internal.build.clocksource=0
atx26o.menu.clocko.1internal.build.speed=1
atx26o.menu.clocko.1internal.build.clocksource=0
atx26o.menu.clocko.20extclock.build.speed=20
atx26o.menu.clocko.20extclock.build.clocksource=2
atx26o.menu.clocko.16extclock.build.speed=16
atx26o.menu.clocko.16extclock.build.clocksource=2
atx26o.menu.clocko.12extclock.build.speed=12
atx26o.menu.clocko.12extclock.build.clocksource=2
atx26o.menu.clocko.10extclock.build.speed=10
atx26o.menu.clocko.10extclock.build.clocksource=2
atx26o.menu.clocko.8extclock.build.speed=8
atx26o.menu.clocko.8extclock.build.clocksource=2
atx26o.menu.clocko.24extclock.build.speed=24
atx26o.menu.clocko.24extclock.build.clocksource=2
atx26o.menu.clocko.25extclock.build.speed=24
atx26o.menu.clocko.25extclock.build.clocksource=2
atx26o.menu.clocko.30extclock.build.speed=30
atx26o.menu.clocko.30extclock.build.clocksource=2
atx26o.menu.clocko.32extclock.build.speed=32
atx26o.menu.clocko.32extclock.build.clocksource=2
atx26o.menu.clocko.20internaltuned.build.speed=20
atx26o.menu.clocko.20internaltuned.build.clocksource=0
atx26o.menu.clocko.20internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atx26o.menu.clocko.16internaltuned.build.speed=16
atx26o.menu.clocko.16internaltuned.build.clocksource=0
atx26o.menu.clocko.16internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atx26o.menu.clocko.12internaltuned.build.speed=12
atx26o.menu.clocko.12internaltuned.build.clocksource=0
atx26o.menu.clocko.12internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atx26o.menu.clocko.24internaltuned.build.speed=24
atx26o.menu.clocko.24internaltuned.build.clocksource=0
atx26o.menu.clocko.24internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atx26o.menu.clocko.25internaltuned.build.speed=25
atx26o.menu.clocko.25internaltuned.build.clocksource=0
atx26o.menu.clocko.25internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atx26o.menu.clocko.30internaltuned.build.speed=30
atx26o.menu.clocko.30internaltuned.build.clocksource=0
atx26o.menu.clocko.30internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atx26o.menu.clocko.32internaltuned.build.speed=32
atx26o.menu.clocko.32internaltuned.build.clocksource=0
atx26o.menu.clocko.32internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atx26o.menu.clocko.20internaltuned.bootloader.OSCCFG=0x02
atx26o.menu.clocko.24internaltuned.bootloader.OSCCFG=0x02
atx26o.menu.clocko.25internaltuned.bootloader.OSCCFG=0x02
atx26o.menu.clocko.30internaltuned.bootloader.OSCCFG=0x02
atx26o.menu.clocko.32internaltuned.bootloader.OSCCFG=0x02
atx26o.menu.clocko.20internal.bootloader.OSCCFG=0x02
atx26o.menu.clocko.10internal.bootloader.OSCCFG=0x02
atx26o.menu.clocko.5internal.bootloader.OSCCFG=0x02

### MILLIS TIMER
atx26o.menu.millis.enabled=Enabled (default timer, TCB1)
atx26o.menu.millis.disabled=Disabled (saves flash)
atx26o.menu.millis.timera=TCA0
atx26o.menu.millis.timerb0=TCB0
atx26o.menu.millis.timerb1=TCB1 (default)
atx26o.menu.millis.rtc=RTC (no micros)
atx26o.menu.millis.rtcxtal=RTC w/w32.768 kHz ext. crystal
atx26o.menu.millis.rtcxosc=RTC w/w32.768 kHz ext. oscillator
atx26o.menu.millis.disabled.build.millistimer=NONE
atx26o.menu.millis.timera.build.millistimer=A0
atx26o.menu.millis.timerb0.build.millistimer=B0
atx26o.menu.millis.timerb1.build.millistimer=B1
atx26o.menu.millis.rtc.build.millistimer=RTC
atx26o.menu.millis.rtcxtal.build.millistimer=RTC_XTAL
atx26o.menu.millis.rtcxosc.build.millistimer=RTC_XOSC

### BODVOLTAGE
atx26o.menu.bodvoltage.1v8=1.8V (5 MHz or less)
atx26o.menu.bodvoltage.2v6=2.6V (10 MHz or less)
atx26o.menu.bodvoltage.4v2=4.2V (20 MHZ or less)
atx26o.menu.bodvoltage.2v1=2.1V
atx26o.menu.bodvoltage.2v9=2.9V
atx26o.menu.bodvoltage.3v3=3.3V
atx26o.menu.bodvoltage.3v7=3.7V
atx26o.menu.bodvoltage.4v0=4.0V
atx26o.menu.bodvoltage.1v8.bootloader.bodlevbits=000
atx26o.menu.bodvoltage.2v6.bootloader.bodlevbits=010
atx26o.menu.bodvoltage.4v2.bootloader.bodlevbits=111
atx26o.menu.bodvoltage.4v0.bootloader.bodlevbits=110
atx26o.menu.bodvoltage.3v7.bootloader.bodlevbits=101
atx26o.menu.bodvoltage.3v3.bootloader.bodlevbits=100
atx26o.menu.bodvoltage.2v9.bootloader.bodlevbits=011
atx26o.menu.bodvoltage.2v1.bootloader.bodlevbits=001

### BODMODE
atx26o.menu.bodmode.disabled=Disabled/Disabled
atx26o.menu.bodmode.enabled=Enabled/Enabled
atx26o.menu.bodmode.ensampfast=Enabled/Sampled (1 kHz)
atx26o.menu.bodmode.ensampslow=Enabled/Sampled (125 Hz)
atx26o.menu.bodmode.sampledfast=Sampled/Sampled (1 kHz)
atx26o.menu.bodmode.sampledslow=Sampled/Sampled (125 Hz)
atx26o.menu.bodmode.sampdisfast=Sampled/Disabled (1 kHz)
atx26o.menu.bodmode.sampdisslow=Sampled/Disabled (125 Hz)
atx26o.menu.bodmode.endisholdwake=Enabled hold wakeup/Disabled
atx26o.menu.bodmode.disabled.bootloader.BODCFG=0x00
atx26o.menu.bodmode.enabled.bootloader.bodmodebits=00101
atx26o.menu.bodmode.ensampfast.bootloader.bodmodebits=00110
atx26o.menu.bodmode.ensampslow.bootloader.bodmodebits=10110
atx26o.menu.bodmode.samplefast.bootloader.bodmodebits=01010
atx26o.menu.bodmode.sampleslow.bootloader.bodmodebits=11010
atx26o.menu.bodmode.sampdisfast.bootloader.bodmodebits=01000
atx26o.menu.bodmode.sampdisslow.bootloader.bodmodebits=11000
atx26o.menu.bodmode.endisholdwake.bootloader.bodmodebits=01100

### UPDI/RESET PIN CONFIGURATION & OPTIBOOT ENTRY
atx26o.menu.resetpinopti_2.UPDI=No RST, UPDI enabled, 8 sec Optiboot after power on or SW reset
atx26o.menu.resetpinopti_2.UPDI.bootloader.file=optiboot_tx2z{bootloader.uartswap}.hex
atx26o.menu.resetpinopti_2.UPDI.bootloader.resetpinbits=01
atx26o.menu.resetpinopti_2.UPDIaltrst=UPDI on PA0, RST on PB4 (Optiboot for 1 sec after reset)
atx26o.menu.resetpinopti_2.UPDIaltrst.bootloader.file=optiboot_tx2z{bootloader.uartswap}_rst.hex
atx26o.menu.resetpinopti_2.UPDIaltrst.bootloader.resetpinbits=11
atx26o.menu.resetpinopti_2.UPDIFastBoot=Optiboot for 1 sec. after power-on & SW reset, no RST pin
atx26o.menu.resetpinopti_2.UPDIFastBoot.bootloader.file=optiboot_tx2z{bootloader.uartswap}_1sec.hex
atx26o.menu.resetpinopti_2.UPDIFastBoot.bootloader.resetpinbits=01
atx26o.menu.resetpinopti_2.reset=RST on PA0, Optiboot for 1 sec. after reset *DANGER* HV UPDI programmer req'd for reprogramming!
atx26o.menu.resetpinopti_2.reset.bootloader.file=optiboot_tx2z{bootloader.uartswap}_rst.hex
atx26o.menu.resetpinopti_2.reset.bootloader.resetpinbits=10
atx26o.menu.resetpinopti_2.gpio=PA0 is GPIO, Optiboot for 8 sec, no RST, no UPDI - *DANGER* HV programmer req'd for reprogramming! (PCHV)
atx26o.menu.resetpinopti_2.gpio.bootloader.file=optiboot_tx2z{bootloader.uartswap}.hex
atx26o.menu.resetpinopti_2.gpio.bootloader.resetpinbits=00

### STARTUP TIME (SUT)
atx26o.menu.startuptimeopti.8=8ms
atx26o.menu.startuptimeopti.0=0ms
atx26o.menu.startuptimeopti.1=1ms
atx26o.menu.startuptimeopti.2=2ms
atx26o.menu.startuptimeopti.4=4ms
atx26o.menu.startuptimeopti.16=16ms
atx26o.menu.startuptimeopti.32=32ms
atx26o.menu.startuptimeopti.64=64ms
atx26o.menu.startuptimeopti.0.bootloader.SYSCFG1=0x00
atx26o.menu.startuptimeopti.1.bootloader.SYSCFG1=0x01
atx26o.menu.startuptimeopti.2.bootloader.SYSCFG1=0x02
atx26o.menu.startuptimeopti.4.bootloader.SYSCFG1=0x03
atx26o.menu.startuptimeopti.8.bootloader.SYSCFG1=0x04
atx26o.menu.startuptimeopti.16.bootloader.SYSCFG1=0x05
atx26o.menu.startuptimeopti.32.bootloader.SYSCFG1=0x06
atx26o.menu.startuptimeopti.64.bootloader.SYSCFG1=0x07

### BOOTLOADER UART PINS
atx26o.menu.bootloaderuart.default=TX:7 (PB2), RX:6 (PB3) (UART0 default pins)
atx26o.menu.bootloaderuart.alternate=TX:14 (PA1), RX:15 (PA2) (UART0 alt pins)
atx26o.menu.bootloaderuart.alternate1=TX:12 (PC2), RX:11 (PC1) (UART1 alt pins)
atx26o.menu.bootloaderuart.default.bootloader.uartswap=
atx26o.menu.bootloaderuart.alternate.bootloader.uartswap=_alt
atx26o.menu.bootloaderuart.alternate1.bootloader.uartswap=_u1alt

##########################################################################
#  WITH OPTIBOOT                                                         #
#  0/1-series                    #    #  #     ####   ###  #   #         #
#                               ##    #  #     #   #   #   ##  #         #
#  ATtiny1614/1604               #    #### === ####    #   # # #         #
#  ATtiny814/804/414             #       #     #       #   #  ##         #
#  ATtiny404/214/204            ###      #     #      ###  #   #         #
#________________________________________________________________________#

### BUILD PARAMETERS
atxy4o.build.text_section_start=.text=0x200
atxy4o.build.millistimer=D0
atxy4o.build.bootload=opti
atxy4o.build.board=AVR_ATtinyxy4
atxy4o.build.clocksource=0
atxy4o.build.core=megatinycore
atxy4o.build.variant=txy4
atxy4o.build.mcu=attiny{build.attiny}
atxy4o.build.f_cpu={build.speed}000000L
atxy4o.build.extra_flags=-DARDUINO_attinyxy4 -DMILLIS_USE_TIMER{build.millistimer} -DUARTBAUD{build.uartvoltage} -DUSING_OPTIBOOT
atxy4o.build.export_merged_output=true

### BOOTLOADING PARAMETERS
atxy4o.bootloader.WDTCFG=0x00
atxy4o.bootloader.BODCFG=0b{bootloader.bodlevbits}{bootloader.bodmodebits}
atxy4o.bootloader.OSCCFG=0x01
atxy4o.bootloader.TCD0CFG=0x00
atxy4o.bootloader.SYSCFG0=0b1100{bootloader.resetpinbits}00
atxy4o.bootloader.APPEND=0x00
atxy4o.bootloader.BOOTEND=0x02
atxy4o.bootloader.tool=avrdude
atxy4o.bootloader.avrdudestring=-Uflash:w:{runtime.platform.path}/bootloaders/hex/{bootloader.file}:i
atxy4o.bootloader.pymcuprogstring=-f{runtime.platform.path}/bootloaders/hex/{bootloader.file} -a write

### UPLOAD VIA OPTIBOOT
atxy4o.upload.workaround=
atxy4o.upload.tool=avrdude
atxy4o.upload.serialparams=-P{serial.port} -b115200
atxy4o.upload.protocol=arduino
atxy4o.upload.extra_params=-D

