SpenceKonde/megaTinyCore/megaavr/boards.txt
### BOD MODE
atxy2o.menu.bodmode.disabled=Disabled/Disabled
atxy2o.menu.bodmode.enabled=Enabled/Enabled
atxy2o.menu.bodmode.ensampfast=Enabled/Sampled (1 kHz)
atxy2o.menu.bodmode.ensampslow=Enabled/Sampled (125 Hz)
atxy2o.menu.bodmode.sampledfast=Sampled/Sampled (1 kHz)
atxy2o.menu.bodmode.sampledslow=Sampled/Sampled (125 Hz)
atxy2o.menu.bodmode.sampdisfast=Sampled/Disabled (1 kHz)
atxy2o.menu.bodmode.sampdisslow=Sampled/Disabled (125 Hz)
atxy2o.menu.bodmode.endisholdwake=Enabled hold wakeup/Disabled
atxy2o.menu.bodmode.disabled.bootloader.BODCFG=0x00
atxy2o.menu.bodmode.enabled.bootloader.bodmodebits=00101
atxy2o.menu.bodmode.ensampfast.bootloader.bodmodebits=00110
atxy2o.menu.bodmode.ensampslow.bootloader.bodmodebits=10110
atxy2o.menu.bodmode.samplefast.bootloader.bodmodebits=01010
atxy2o.menu.bodmode.sampleslow.bootloader.bodmodebits=11010
atxy2o.menu.bodmode.sampdisfast.bootloader.bodmodebits=01000
atxy2o.menu.bodmode.sampdisslow.bootloader.bodmodebits=11000
atxy2o.menu.bodmode.endisholdwake.bootloader.bodmodebits=01100

### BOOTLOADER UART PINS
# Weird thing - non-alt-0pin bootloaders for 2-series are separate binaries because of LED pin
# But when altgernate pins are used, it can use the same binary as all other 0/1-series!
atxy2o.menu.bootloaderuart.default=TX:0 (PA6), RX:1 (PA7)
atxy2o.menu.bootloaderuart.alternate=TX:2 (PA1), RX:3 (PA2)
atxy2o.menu.bootloaderuart.default.bootloader.uartswap=2
atxy2o.menu.bootloaderuart.alternate.bootloader.uartswap=z_alt

### VOLTAGE FOR UART BAUD CORRECTION
atxy2o.menu.uartvoltage.skip=Ignore (saves flash, almost always fine)
atxy2o.menu.uartvoltage.skip.build.uartvoltage=NA
atxy2o.menu.uartvoltage.5v=Closer to 5v
atxy2o.menu.uartvoltage.5v.build.uartvoltage=5V
atxy2o.menu.uartvoltage.3v=Closer to 3v
atxy2o.menu.uartvoltage.3v.build.uartvoltage=3V

### UPDI/RESET PIN CONFIGURATION & OPTIBOOT ENTRY
atxy2o.menu.resetpinopti.UPDI=UPDI, Optiboot for 8 sec. after power-on & reset
atxy2o.menu.resetpinopti.UPDI.bootloader.file=optiboot_txy{bootloader.uartswap}.hex
atxy2o.menu.resetpinopti.UPDI.bootloader.resetpinbits=01
atxy2o.menu.resetpinopti.UPDIFastBoot=UPDI, Optiboot for 1 sec. after power-on & reset
atxy2o.menu.resetpinopti.UPDIFastBoot.bootloader.file=optiboot_txy{bootloader.uartswap}_1sec.hex
atxy2o.menu.resetpinopti.UPDIFastBoot.bootloader.resetpinbits=01
atxy2o.menu.resetpinopti.reset=Reset, Optiboot for 1 sec. after reset *DANGER* HV UPDI programmer req'd for reprogramming!
atxy2o.menu.resetpinopti.reset.bootloader.file=optiboot_txy{bootloader.uartswap}_rst.hex
atxy2o.menu.resetpinopti.reset.bootloader.resetpinbits=10
atxy2o.menu.resetpinopti.gpio=GPIO, Optiboot for 8 sec. after power-on & SW reset *DANGER* HV programmer req'd for reprogramming! (PCHV)
atxy2o.menu.resetpinopti.gpio.bootloader.file=optiboot_txy{bootloader.uartswap}.hex
atxy2o.menu.resetpinopti.gpio.bootloader.resetpinbits=00

### STARTUP TIME (SUT)
atxy2o.menu.startuptimeopti.8=8ms
atxy2o.menu.startuptimeopti.0=0ms
atxy2o.menu.startuptimeopti.1=1ms
atxy2o.menu.startuptimeopti.2=2ms
atxy2o.menu.startuptimeopti.4=4ms
atxy2o.menu.startuptimeopti.16=16ms
atxy2o.menu.startuptimeopti.32=32ms
atxy2o.menu.startuptimeopti.64=64ms
atxy2o.menu.startuptimeopti.0.bootloader.SYSCFG1=0x00
atxy2o.menu.startuptimeopti.1.bootloader.SYSCFG1=0x01
atxy2o.menu.startuptimeopti.2.bootloader.SYSCFG1=0x02
atxy2o.menu.startuptimeopti.4.bootloader.SYSCFG1=0x03
atxy2o.menu.startuptimeopti.8.bootloader.SYSCFG1=0x04
atxy2o.menu.startuptimeopti.16.bootloader.SYSCFG1=0x05
atxy2o.menu.startuptimeopti.32.bootloader.SYSCFG1=0x06
atxy2o.menu.startuptimeopti.64.bootloader.SYSCFG1=0x07



##########################################################################
#                                                                        #
# Curiosity Nano    #   # ###  ### ####   ###   ### #  # ### ####      ###
# Xplained Mini     ## ##  #  #    #   # #   # #    #  #  #  #   #   #####
# Xplained Pro      # # #  #  #    ####  #   # #    ####  #  ####  #######
# WITH OPTIBOOT     #   #  #  #    # #   #   # #    #  #  #  #       #####
#                   #   # ###  ### #  ##  ###   ### #  # ### #         ###
#________________________________________________________________________#

### BUILD PARAMETERS
microchipo.build.text_section_start=.text=0x200
microchipo.build.board=AVR_MicrochipOfficial
microchipo.build.millistimer=D0
microchipo.build.bootload=opti
microchipo.build.clocksource=0
microchipo.build.core=megatinycore
microchipo.build.mcu=attiny{build.attiny}
microchipo.build.f_cpu={build.speed}000000L
microchipo.build.export_merged_output=false
microchipo.bootloader.avrdudestring=-Uflash:w:{runtime.platform.path}/bootloaders/hex/{bootloader.file}:i
microchipo.bootloader.pymcuprogstring=-f{runtime.platform.path}/bootloaders/hex/{bootloader.file} -a write

### BOOTLOADING PARAMETERS (FUSES)
microchipo.bootloader.WDTCFG=0x00
microchipo.bootloader.BODCFG=0b{bootloader.bodlevbits}{bootloader.bodmodebits}
microchipo.bootloader.OSCCFG=0x01
microchipo.bootloader.TCD0CFG=0x00
microchipo.bootloader.SYSCFG0=0b1100{bootloader.resetpinbits}0{bootloader.eesavebit}
microchipo.bootloader.APPEND=0x00
microchipo.bootloader.BOOTEND=0x00
microchipo.bootloader.tool=avrdude

### UPLOAD VIA OPTIBOOT
microchipo.upload.workaround=
microchipo.upload.upload.serialparams=-P{serial.port} -b115200
microchipo.upload.tool=avrdude
microchipo.upload.protocol=arduino
microchipo.upload.extra_params=-D

### CHIP
microchipo.menu.board_name.cn3217=Curiosity Nano ATtiny3217
microchipo.menu.board_name.cn3217.build.board=AVR_CuriosityNano3217
microchipo.menu.board_name.cn3217.build.extra_flags=-DARDUINO_attinyxy7 -DMILLIS_USE_TIMER{build.millistimer} -DUARTBAUD{build.uartvoltage} -DLED_BUILTIN=PIN_PA3 -DPIN_BUTTON_BUILTIN=PIN_PB7
microchipo.menu.board_name.cn3217.bootloader.file=optiboot_Curiosity3217.hex
microchipo.menu.board_name.cn3217.build.attiny=3217
microchipo.menu.board_name.cn3217.build.variant=txy7
microchipo.menu.board_name.cn3217.upload.maximum_size=32768
microchipo.menu.board_name.cn3217.upload.maximum_data_size=2048

microchipo.menu.board_name.cn1627=Curiosity Nano ATtiny1627
microchipo.menu.board_name.cn1627.build.board=AVR_CuriosityNano1627
microchipo.menu.board_name.cn1627.build.extra_flags=-DARDUINO_attinyxy7 -DMILLIS_USE_TIMER{build.millistimer} -DUARTBAUD{build.uartvoltage} -DLED_BUILTIN=PIN_PB4 -DPIN_BUTTON_BUILTIN=PIN_PB7
microchipo.menu.board_name.cn1627.bootloader.file=optiboot_Curiosity1627.hex
microchipo.menu.board_name.cn1627.build.millistimer=B1
microchipo.menu.board_name.cn1627.build.attiny=1627
microchipo.menu.board_name.cn1627.build.variant=txy7
microchipo.menu.board_name.cn1627.upload.maximum_size=16384
microchipo.menu.board_name.cn1627.upload.maximum_data_size=2048

microchipo.menu.board_name.cn1607=Curiosity Nano ATtiny1607
microchipo.menu.board_name.cn1607.build.board=AVR_CuriosityNano1607
microchipo.menu.board_name.cn1607.build.extra_flags=-DARDUINO_attinyxy7 -DMILLIS_USE_TIMER{build.millistimer} -DUARTBAUD{build.uartvoltage} -DLED_BUILTIN=PIN_PC4 -DPIN_BUTTON_BUILTIN=PIN_PB7
microchipo.menu.board_name.cn1607.bootloader.file=optiboot_Curiosity1607.hex
microchipo.menu.board_name.cn1607.build.attiny=1607
microchipo.menu.board_name.cn1607.build.variant=txy7
microchipo.menu.board_name.cn1607.build.millistimer=A0
microchipo.menu.board_name.cn1607.upload.maximum_size=16384
microchipo.menu.board_name.cn1607.upload.maximum_data_size=1024

