SpenceKonde/megaTinyCore/megaavr/boards.txt
microchipo.menu.board_name.xp3217=Xplained Pro ATtiny3217
microchipo.menu.board_name.xp3217.build.board=AVR_XplainedPro3217
microchipo.menu.board_name.xp3217.build.extra_flags=-DARDUINO_attinyxy7 -DMILLIS_USE_TIMER{build.millistimer} -DUARTBAUD{build.uartvoltage} -DLED_BUILTIN=PIN_PB4 -DPIN_BUTTON_BUILTIN=PIN_PB5
microchipo.menu.board_name.xp3217.bootloader.file=optiboot_XplainedPro3217.hex
microchipo.menu.board_name.xp3217.build.attiny=3217
microchipo.menu.board_name.xp3217.build.variant=txy7
microchipo.menu.board_name.xp3217.build.millistimer=D0
microchipo.menu.board_name.xp3217.upload.maximum_size=32768
microchipo.menu.board_name.xp3217.upload.maximum_data_size=2048

microchipo.menu.board_name.xp817=Xplained Pro ATtiny817
microchipo.menu.board_name.xp817.build.board=AVR_XplainedPro817
microchipo.menu.board_name.xp817.build.extra_flags=-DARDUINO_attinyxy7 -DMILLIS_USE_TIMER{build.millistimer} -DUARTBAUD{build.uartvoltage} -DLED_BUILTIN=PIN_PB4 -DPIN_BUTTON_BUILTIN=PIN_PB5
microchipo.menu.board_name.xp817.bootloader.file=optiboot_XplainedPro817.hex
microchipo.menu.board_name.xp817.build.attiny=817
microchipo.menu.board_name.xp817.build.variant=txy7
microchipo.menu.board_name.xp817.build.millistimer=D0
microchipo.menu.board_name.xp817.upload.maximum_size=8192
microchipo.menu.board_name.xp817.upload.maximum_data_size=512

microchipo.menu.board_name.xm817=Xplained Mini ATtiny817
microchipo.menu.board_name.xm817.build.board=AVR_XplainedMini817
microchipo.menu.board_name.xm817.build.extra_flags=-DARDUINO_attinyxy7 -DMILLIS_USE_TIMER{build.millistimer} -DUARTBAUD{build.uartvoltage} -DLED_BUILTIN=PIN_PC0 -DPIN_BUTTON_BUILTIN=PIN_PC5
microchipo.menu.board_name.xm817.bootloader.file=optiboot_XplainedMini817.hex
microchipo.menu.board_name.xm817.build.attiny=817
microchipo.menu.board_name.xm817.build.variant=txy7
microchipo.menu.board_name.xm817.build.millistimer=D0
microchipo.menu.board_name.xm817.upload.maximum_size=8192
microchipo.menu.board_name.xm817.upload.maximum_data_size=512

microchipo.menu.board_name.xn416=Xplained Nano ATtiny416
microchipo.menu.board_name.xn416.build.board=AVR_XplainedNano416
microchipo.menu.board_name.xn416.build.extra_flags=-DARDUINO_attinyxy6 -DMILLIS_USE_TIMER{build.millistimer} -DUARTBAUD{build.uartvoltage} -DLED_BUILTIN=PIN_PB5 -DPIN_BUTTON_BUILTIN=PIN_PB4 -DUART0_SWAP
microchipo.menu.board_name.xn416.bootloader.file=optiboot_XplainedNano416.hex
microchipo.menu.board_name.xn416.build.attiny=416
microchipo.menu.board_name.xn416.build.variant=txy6
microchipo.menu.board_name.xn416.build.millistimer=D0
microchipo.menu.board_name.xn416.upload.maximum_size=4096
microchipo.menu.board_name.xn416.upload.maximum_data_size=256


### CLOCK SOURCE
microchipo.menu.clock.20internal=20 MHz internal
microchipo.menu.clock.16internal=16 MHz internal
microchipo.menu.clock.10internal=10 MHz internal
microchipo.menu.clock.8internal=8 MHz internal
microchipo.menu.clock.5internal=5 MHz internal
microchipo.menu.clock.4internal=4 MHz internal
microchipo.menu.clock.1internal=1 MHz internal
microchipo.menu.clock.20internaltuned=20 MHz internal - tuned
microchipo.menu.clock.16internaltuned=16 MHz internal - tuned
microchipo.menu.clock.12internaltuned=12 MHz internal - tuned
microchipo.menu.clock.24internaltuned=24 MHz internal - tuned, overclocked
microchipo.menu.clock.25internaltuned=25 MHz internal - tuned, overclocked
microchipo.menu.clock.30internaltuned=30 MHz internal - tuned, overclocked, may be unstable, req. 20 MHz fuse
microchipo.menu.clock.32internaltuned=32 MHz internal - tuned, 2-series, overclocked, may be unstable, req. 20 MHz fuse
microchipo.menu.clock.20internal.build.speed=20
microchipo.menu.clock.20internal.build.clocksource=0
microchipo.menu.clock.16internal.build.speed=16
microchipo.menu.clock.16internal.build.clocksource=0
microchipo.menu.clock.10internal.build.speed=10
microchipo.menu.clock.10internal.build.clocksource=0
microchipo.menu.clock.8internal.build.speed=8
microchipo.menu.clock.8internal.build.clocksource=0
microchipo.menu.clock.5internal.build.speed=5
microchipo.menu.clock.5internal.build.clocksource=0
microchipo.menu.clock.4internal.build.speed=4
microchipo.menu.clock.4internal.build.clocksource=0
microchipo.menu.clock.1internal.build.speed=1
microchipo.menu.clock.1internal.build.clocksource=0
microchipo.menu.clock.20internaltuned.build.speed=20
microchipo.menu.clock.20internaltuned.build.clocksource=0
microchipo.menu.clock.20internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
microchipo.menu.clock.16internaltuned.build.speed=16
microchipo.menu.clock.16internaltuned.build.clocksource=0
microchipo.menu.clock.16internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
microchipo.menu.clock.12internaltuned.build.speed=12
microchipo.menu.clock.12internaltuned.build.clocksource=0
microchipo.menu.clock.12internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
microchipo.menu.clock.24internaltuned.build.speed=24
microchipo.menu.clock.24internaltuned.build.clocksource=0
microchipo.menu.clock.24internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
microchipo.menu.clock.25internaltuned.build.speed=25
microchipo.menu.clock.25internaltuned.build.clocksource=0
microchipo.menu.clock.25internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
microchipo.menu.clock.30internaltuned.build.speed=30
microchipo.menu.clock.30internaltuned.build.clocksource=0
microchipo.menu.clock.30internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
microchipo.menu.clock.32internaltuned.build.speed=32
microchipo.menu.clock.32internaltuned.build.clocksource=0
microchipo.menu.clock.32internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
microchipo.menu.clock.20internaltuned.bootloader.OSCCFG=0x02
microchipo.menu.clock.24internaltuned.bootloader.OSCCFG=0x02
microchipo.menu.clock.25internaltuned.bootloader.OSCCFG=0x02
microchipo.menu.clock.30internaltuned.bootloader.OSCCFG=0x02
microchipo.menu.clock.32internaltuned.bootloader.OSCCFG=0x02
microchipo.menu.clock.20internal.bootloader.OSCCFG=0x02
microchipo.menu.clock.10internal.bootloader.OSCCFG=0x02
microchipo.menu.clock.5internal.bootloader.OSCCFG=0x02

### BOD VOLTAGE
microchipo.menu.bodvoltage.1v8=1.8V (5 MHz or less)
microchipo.menu.bodvoltage.2v6=2.6V (10 MHz or less)
microchipo.menu.bodvoltage.4v2=4.2V (20 MHZ or less)
microchipo.menu.bodvoltage.2v1=2.1V
microchipo.menu.bodvoltage.2v9=2.9V
microchipo.menu.bodvoltage.3v3=3.3V
microchipo.menu.bodvoltage.3v7=3.7V
microchipo.menu.bodvoltage.4v0=4.0V
microchipo.menu.bodvoltage.1v8.bootloader.bodlevbits=000
microchipo.menu.bodvoltage.2v6.bootloader.bodlevbits=010
microchipo.menu.bodvoltage.4v2.bootloader.bodlevbits=111
microchipo.menu.bodvoltage.4v0.bootloader.bodlevbits=110
microchipo.menu.bodvoltage.3v7.bootloader.bodlevbits=101
microchipo.menu.bodvoltage.3v3.bootloader.bodlevbits=100
microchipo.menu.bodvoltage.2v9.bootloader.bodlevbits=011
microchipo.menu.bodvoltage.2v1.bootloader.bodlevbits=001

