SpenceKonde/megaTinyCore/megaavr/boards.txt
### BOD MODE
microchipo.menu.bodmode.disabled=Disabled/Disabled
microchipo.menu.bodmode.enabled=Enabled/Enabled
microchipo.menu.bodmode.ensampfast=Enabled/Sampled (1 kHz)
microchipo.menu.bodmode.ensampslow=Enabled/Sampled (125 Hz)
microchipo.menu.bodmode.sampledfast=Sampled/Sampled (1 kHz)
microchipo.menu.bodmode.sampledslow=Sampled/Sampled (125 Hz)
microchipo.menu.bodmode.sampdisfast=Sampled/Disabled (1 kHz)
microchipo.menu.bodmode.sampdisslow=Sampled/Disabled (125 Hz)
microchipo.menu.bodmode.endisholdwake=Enabled hold wakeup/Disabled
microchipo.menu.bodmode.disabled.bootloader.BODCFG=0x00
microchipo.menu.bodmode.enabled.bootloader.bodmodebits=00101
microchipo.menu.bodmode.ensampfast.bootloader.bodmodebits=00110
microchipo.menu.bodmode.ensampslow.bootloader.bodmodebits=10110
microchipo.menu.bodmode.samplefast.bootloader.bodmodebits=01010
microchipo.menu.bodmode.sampleslow.bootloader.bodmodebits=11010
microchipo.menu.bodmode.sampdisfast.bootloader.bodmodebits=01000
microchipo.menu.bodmode.sampdisslow.bootloader.bodmodebits=11000
microchipo.menu.bodmode.endisholdwake.bootloader.bodmodebits=01100

### MILLIS TIMER
microchipo.menu.millis.enabled=Enabled (default timer)
microchipo.menu.millis.disabled=Disabled (saves flash)
microchipo.menu.millis.timera=TCA0 (default on 0-series)
microchipo.menu.millis.timerd=TCD0 (1-series only, default there)
microchipo.menu.millis.timerb0=TCB0 (breaks tone() and Servo except on 1627, 3217)
microchipo.menu.millis.timerb1=TCB1 (3217 and 1627 only, default 2-series)
microchipo.menu.millis.rtc=RTC (no micros)
microchipo.menu.millis.rtcxtal=RTC w/w32.768 kHz ext. crystal (1/2-series only, no micros)
microchipo.menu.millis.disabled.build.millistimer=NONE
microchipo.menu.millis.timera.build.millistimer=A0
microchipo.menu.millis.timerd.build.millistimer=D0
microchipo.menu.millis.timerb0.build.millistimer=B0
microchipo.menu.millis.timerb1.build.millistimer=B1
microchipo.menu.millis.rtc.build.millistimer=RTC
microchipo.menu.millis.rtcxtal.build.millistimer=RTC_XTAL
microchipo.menu.millis.rtcxosc.build.millistimer=RTC_XOSC

### STARTUP TIME (SUT)
microchipo.menu.startuptime.8=8ms
microchipo.menu.startuptime.0=0ms
microchipo.menu.startuptime.1=1ms
microchipo.menu.startuptime.2=2ms
microchipo.menu.startuptime.4=4ms
microchipo.menu.startuptime.16=16ms
microchipo.menu.startuptime.32=32ms
microchipo.menu.startuptime.64=64ms
microchipo.menu.startuptime.0.bootloader.SYSCFG1=0x00
microchipo.menu.startuptime.1.bootloader.SYSCFG1=0x01
microchipo.menu.startuptime.2.bootloader.SYSCFG1=0x02
microchipo.menu.startuptime.4.bootloader.SYSCFG1=0x03
microchipo.menu.startuptime.8.bootloader.SYSCFG1=0x04
microchipo.menu.startuptime.16.bootloader.SYSCFG1=0x05
microchipo.menu.startuptime.32.bootloader.SYSCFG1=0x06
microchipo.menu.startuptime.64.bootloader.SYSCFG1=0x07

### VOLTAGE FOR UART BAUD CORRECTION
microchipo.menu.uartvoltage.skip=Ignore (saves flash, almost always fine)
microchipo.menu.uartvoltage.skip.build.uartvoltage=NA
microchipo.menu.uartvoltage.5v=Closer to 5v
microchipo.menu.uartvoltage.3v=Closer to 3v
microchipo.menu.uartvoltage.5v.build.uartvoltage=5V
microchipo.menu.uartvoltage.3v.build.uartvoltage=3V
